app/controllers/api/v1/tasks_controller.rb

    def show
      @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @task = Task.new(task_params)
      if @task.save
---
INSERT INTO "tasks" ("user_id", "title", "created_at", "updated_at", "date", "time") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["title", "Hello"], ["created_at", "2018-11-17 23:28:33.631530"], ["updated_at", "2018-11-17 23:28:33.631530"], ["date", "Hello"], ["time", "Hello"]]

    def update
      @task = Task.find_by(id: params[:id])
      @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "is_active" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["is_active", false], ["updated_at", "2018-12-02 08:42:02.235459"], ["id", 152]]

    def destroy
      @task = Task.find_by(id: params[:id])
        if@task
          @task.destroy()
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]