app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "is_active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["is_active", false], ["updated_at", "2018-11-30 18:19:59.471313"], ["id", 10]]
---
    def update
      @user = User.find_by(id: params[:id])
      @user.update(user_params)

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "ok"], ["created_at", "2018-11-30 18:14:02.588213"], ["updated_at", "2018-11-30 18:14:02.588213"]]
---
    def create
      @user = User.new(user_params)
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]
---
    def destroy
      @user = User.find_by(id: params[:id])
      if @user
        @user.destroy()